package com.wupol.myopia.business.core.screening.flow.util;

/**
 * 近视防控判断标准工具
 *
 * @author hang.yuan 2022/4/6 18:38
 */
public class JudgmentStandardUtil {

    /**
     * 1、筛查学生数、实际筛查学生数、完成率、纳入统计的学生数
     */

    /**
     * 2、视力不良/视力低下、平均视力
     */

    /**
     * 3、近视、远视、散光、远视储备不足
     */

    /**
     * 4、0-3级预警判断 （满足其一即可判断预警级别）
     *      1、裸眼视力数据
     *      2、屈光数据（近视、散光）
     *      3、屈光数据（近视、散光）
     *      4、远视储备不足（也纳入0级预警中）
     */

    /**
     * 5、建议就诊
     */

    /**
     * 6、身高范围标准
     */

    /**
     * 7、复测
     */

    /**
     * 8、常见病相关指标【占比：保留2位小数点】
     */

    /**
     * 血压偏高率
     */
}

